'''
假设列表lst_info存放了某单位每个员工的基本信息(包括姓名、性别和年龄)。
试编写程序，实现将用户要求的员工信息从列表中删除，并将删除信息后的列表输出。
提示：
（1）列表内容和需要删除的员工姓名由用户输入
（2）员工姓名不存在，则输出“该员工不存在”
样例：
输入：
[["李玉","男",25],["金忠","男",23],["刘妍","女",21],["莫心","女",24],["沈冲","男",28]]
金忠
输出：
[["李玉","男",25],["刘妍","女",21],["莫心","女",24],["沈冲","男",28]]
'''
lst_info=eval(input())
name=input()
# count=-1

for list_every in lst_info:
    # count+=1
    if name in list_every:
        lst_info.pop(list_every) # 不需要count
        print(lst_info)
        break
else:
    print("该员工不存在")